# OnClick Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ITemporaryGraphicsHandler..::..OnClick Method
ITemporaryGraphicsHandler Interface See Also
---
Handles mouse click event on a given temporary graphics object managed by TemporaryGraphicsManager.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
void OnClick(
	TemporaryGraphicsCommandData data
)
```

Visual Basic
---
```text
Sub OnClick ( _
	data As TemporaryGraphicsCommandData _
)
```

Visual C++
---
```text
void OnClick(
	TemporaryGraphicsCommandData^ data
)
```

# ### Parameters
data
    Type: Autodesk.Revit.UI..::..TemporaryGraphicsCommandData The context data of the click event.
# See Also
ITemporaryGraphicsHandler Interface
Autodesk.Revit.UI Namespace